hareeshsureddy/workspace_1.18.1-MCU1-/007_stm32f4xx_driver/Src/003_Button_interrupt.c
/**
  ******************************************************************************
  * @file    main.c
  * @author  Auto-generated by STM32CubeIDE
  * @version V1.0
  * @brief   Default main function.
  ******************************************************************************
*/
#include <stdint.h>
#include <string.h>
#include <stm32f407xx.h>
#include "stm32f407xx_gpio_drive.h"
void delay(){
for (int i=0;i<500000;i++);
}
int main(void)
{
    /* Loop forever */
	/*Configure the Pin 14 in a GPIOA, with output and Push pull */
	GPIO_handle_t GPIO_Congig_data;
	memset(&GPIO_Congig_data,0,sizeof(GPIO_Congig_data));		//To clear the structure members
	GPIO_Congig_data.GPIO_confg.GPIO_PinNumber=GPIO_PIN_14;
	GPIO_Congig_data.GPIO_confg.GPIO_PinMode=GPIO_MODE_OUT;
	GPIO_Congig_data.GPIO_confg.GPIO_PinSpeed=GPIO_SPEED_V_HIGH;
	GPIO_Congig_data.GPIO_confg.GPIO_PinPupdControl=GPIO_NO_PUPD;
	GPIO_Congig_data.GPIO_confg.GPIO_PinOPtype=GPIO_OUTTYPE_PP; /*Push pull configuration*/
	//GPIO_Congig_data.GPIO_confg.GPIO_PinOPtype=GPIO_OUTTYPE_OD; /*Open drain configuration*/
	GPIO_Congig_data.pGPIOx=GPIOA;
	GPIO_handle_t *pGPIOx_handle=&GPIO_Congig_data;
	/*Enable GPIOA Peripheral clock*/
	GPIO_PeripClkCntr_Alt('A',ENABLE);
	GPIO_Init(pGPIOx_handle);
	/*Configure the Pin 5 in a GPIOD, with input mode and internal pull down*/
	memset(&GPIO_Congig_data,0,sizeof(GPIO_Congig_data));		//To clear the structure members
	GPIO_Congig_data.GPIO_confg.GPIO_PinNumber=GPIO_PIN_5;		//PD5
	GPIO_Congig_data.GPIO_confg.GPIO_PinMode=GPIO_MODE_IT_FT;
	GPIO_Congig_data.GPIO_confg.GPIO_PinSpeed=GPIO_SPEED_V_HIGH;
	GPIO_Congig_data.GPIO_confg.GPIO_PinPupdControl=GPIO_PU;	/*External PD is there */
	GPIO_Congig_data.pGPIOx=GPIOD;
	GPIO_PeripClkCntr_Alt('D',ENABLE);		//GPIOD peripheral clock enable
	GPIO_Init(pGPIOx_handle);
	GPIO_IRQPriority_Config(EXTI_5TO9,NVIC_IRQ_PR_4);
	GPIO_IRQConfig(EXTI_5TO9,ENABLE);
	while(1);

}

void EXTI0_IRQHandler(void){
	//handle the interrupt
	GPIO_IRQHandling(GPIO_PIN_5);
	//On GPIO interrupt toggle LED
	GPIO_ToggleOutPin(GPIOA,GPIO_PIN_14);
	}
